#### It happens all the time: someone gives you data containing malformed strings,
#### Python, lists and missing data. How do you tidy it up so you can get on with the
#### analysis?
#### Take this monstrosity as the DataFrame to use in the following puzzles:
#### df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [187]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],'Airline': ['KLM(!)', ' (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [188]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1                 (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

#### 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column)

In [189]:
newindex = np.arange(1,df.From_To.count()+1)
newindex
df.set_index(newindex,inplace=True)
df

               Airline  FlightNumber           From_To  RecentDelays
1               KLM(!)       10045.0      LoNDon_paris      [23, 47]
2                 (12)           NaN      MAdrid_miLAN            []
3  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
4       12. Air France           NaN    Budapest_PaRis          [13]
5          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

In [190]:
newindex = np.arange(1,df.From_To.count()+1)
newindex
df.set_index(newindex,inplace=True)
df

               Airline  FlightNumber           From_To  RecentDelays
1               KLM(!)       10045.0      LoNDon_paris      [23, 47]
2                 (12)           NaN      MAdrid_miLAN            []
3  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
4       12. Air France           NaN    Budapest_PaRis          [13]
5          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

In [191]:
for i in np.arange(1,df.From_To.count()+1):
    if pd.isnull(df.FlightNumber.loc[i,]):
        df.loc[i,'FlightNumber'] = df.FlightNumber.loc[i-1,]+10
df['FlightNumber']
df

               Airline  FlightNumber           From_To  RecentDelays
1               KLM(!)       10045.0      LoNDon_paris      [23, 47]
2                 (12)       10055.0      MAdrid_miLAN            []
3  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
4       12. Air France       10075.0    Budapest_PaRis          [13]
5          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

In [192]:
df['FlightNumber'] = df['FlightNumber'].astype(int)
df

               Airline  FlightNumber           From_To  RecentDelays
1               KLM(!)         10045      LoNDon_paris      [23, 47]
2                 (12)         10055      MAdrid_miLAN            []
3  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
4       12. Air France         10075    Budapest_PaRis          [13]
5          "Swiss Air"         10085   Brussels_londOn      [67, 32]

#### 2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame

In [193]:
data = df.copy()

In [194]:
data[["From","To"]] = data['From_To'].str.extract('(?P<From>[\s\S]+)_(?P<To>[\s\S]+)', expand=True)
data

,Airline,FlightNumber,From_To,RecentDelays,From,To
1,KLM(!),10045,LoNDon_paris,"[23, 47]",LoNDon,paris
2,(12),10055,MAdrid_miLAN,[],MAdrid,miLAN
3,(British Airways. ),10065,londON_StockhOlm,"[24, 43, 87]",londON,StockhOlm
4,12. Air France,10075,Budapest_PaRis,[13],Budapest,PaRis
5,"""Swiss Air""",10085,Brussels_londOn,"[67, 32]",Brussels,londOn

#### 3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [195]:
data.From = data.From.str.capitalize()
data.To = data.To.str.capitalize()
data.From_To = data.From_To.str.capitalize()

In [196]:
data

,Airline,FlightNumber,From_To,RecentDelays,From,To
1,KLM(!),10045,London_paris,"[23, 47]",London,Paris
2,(12),10055,Madrid_milan,[],Madrid,Milan
3,(British Airways. ),10065,London_stockholm,"[24, 43, 87]",London,Stockholm
4,12. Air France,10075,Budapest_paris,[13],Budapest,Paris
5,"""Swiss Air""",10085,Brussels_london,"[67, 32]",Brussels,London

#### 4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [197]:
df.drop('From_To',axis=1,inplace=True)
df

               Airline  FlightNumber  RecentDelays
1               KLM(!)         10045      [23, 47]
2                 (12)         10055            []
3  (British Airways. )         10065  [24, 43, 87]
4       12. Air France         10075          [13]
5          "Swiss Air"         10085      [67, 32]

In [198]:
df['From_To'] = data['From_To']
df

               Airline  FlightNumber  RecentDelays           From_To
1               KLM(!)         10045      [23, 47]      London_paris
2                 (12)         10055            []      Madrid_milan
3  (British Airways. )         10065  [24, 43, 87]  London_stockholm
4       12. Air France         10075          [13]    Budapest_paris
5          "Swiss Air"         10085      [67, 32]   Brussels_london

#### 5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

#### Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [199]:
df

               Airline  FlightNumber  RecentDelays           From_To
1               KLM(!)         10045      [23, 47]      London_paris
2                 (12)         10055            []      Madrid_milan
3  (British Airways. )         10065  [24, 43, 87]  London_stockholm
4       12. Air France         10075          [13]    Budapest_paris
5          "Swiss Air"         10085      [67, 32]   Brussels_london

In [200]:
delays = df['RecentDelays'].apply(pd.Series)
delays

      0     1     2
1  23.0  47.0   NaN
2   NaN   NaN   NaN
3  24.0  43.0  87.0
4  13.0   NaN   NaN
5  67.0  32.0   NaN

In [201]:
delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]

In [202]:
df = df.drop('RecentDelays', axis=1).join(delays)

In [203]:
df

,Airline,FlightNumber,From_To,delay_1,delay_2,delay_3
1,KLM(!),10045,London_paris,23.0,47.0,NaN
2,(12),10055,Madrid_milan,NaN,NaN,NaN
3,(British Airways. ),10065,London_stockholm,24.0,43.0,87.0
4,12. Air France,10075,Budapest_paris,13.0,NaN,NaN
5,"""Swiss Air""",10085,Brussels_london,67.0,32.0,NaN